jimmywong2003/nrf5-packet-error-rate-measurement-on-ble-connection/ble_app_image_transfer_c/main.c
        switch (pin_no)
        {
        case LEDBUTTON_BUTTON_PIN:
                // Prss the LED button to trigger the throughput test start
                err_code = ble_lbs_led_status_send(&m_ble_lbs_c, button_action);
                if (err_code != NRF_SUCCESS &&
                    err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                    err_code != NRF_ERROR_INVALID_STATE)
                {
                        APP_ERROR_CHECK(err_code);
                }
                if (err_code == NRF_SUCCESS)
                {
                        NRF_LOG_INFO("LBS write LED state %d", button_action);

                        if (button_action == APP_BUTTON_PUSH)
                        {
                                receive_byte = 0;
                                previous_receive_byte = 0;

                                packet_error_rate_reset_counter();
                                if (m_packet_error_rate_timer_is_running != false)
                                {
                                        err_code = app_timer_start(m_packet_error_rate_update_timer_id, PACKET_ERROR_UPDATE_TIMER_INTERVAL, NULL);
                                        APP_ERROR_CHECK(err_code);
                                        m_packet_error_rate_timer_is_running = true;
                                }

                        }
                }
                break;

        default:
                APP_ERROR_HANDLER(pin_no);
                break;
        }
}

/**@brief Function for handling Scaning events.
 *
 * @param[in]   p_scan_evt   Scanning event.
 */
static void scan_evt_handler(scan_evt_t const *p_scan_evt)
{
        ret_code_t err_code;

        switch (p_scan_evt->scan_evt_id)
        {
        case NRF_BLE_SCAN_EVT_CONNECTING_ERROR:
                err_code = p_scan_evt->params.connecting_err.err_code;
                APP_ERROR_CHECK(err_code);
                break;

        case NRF_BLE_SCAN_EVT_CONNECTED:
        {
                ble_gap_evt_connected_t const *p_connected =
                        p_scan_evt->params.connected.p_connected;

                // Scan is automatically stopped by the connection.
                NRF_LOG_INFO("Connecting to target 0x%02x%02x%02x%02x%02x%02x",
                             p_connected->peer_addr.addr[0],
                             p_connected->peer_addr.addr[1],
                             p_connected->peer_addr.addr[2],
                             p_connected->peer_addr.addr[3],
                             p_connected->peer_addr.addr[4],
                             p_connected->peer_addr.addr[5]);
        }
        break;

        case NRF_BLE_SCAN_EVT_SCAN_TIMEOUT:
        {
                NRF_LOG_INFO("Scan timed out.");
                scan_start();
        }
        break;

        default:
                break;
        }
}

/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
        ret_code_t err_code;

        //The array must be static because a pointer to it will be saved in the button handler module.
        static app_button_cfg_t buttons[] =
        {
                {LEDBUTTON_BUTTON_PIN, false, BUTTON_PULL, button_event_handler},
                {START_CHANEL_SURVERY_START_PIN, false, BUTTON_PULL, button_event_handler},
                {UPDATE_CHANNEL_MAP_PIN, false, BUTTON_PULL, button_event_handler},
        };

        err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                                   BUTTON_DETECTION_DELAY);
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling database discovery events.
 *
 * @details This function is callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function should forward the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t *p_evt)
{
        ble_lbs_on_db_disc_evt(&m_ble_lbs_c, p_evt);
        ble_nus_c_on_db_disc_evt(&m_ble_nus_c, p_evt);
        ble_its_c_on_db_disc_evt(&m_ble_its_c, p_evt);
}

/**@brief Database discovery initialization.
 */
static void db_discovery_init(void)
{
        ret_code_t err_code = ble_db_discovery_init(db_disc_handler);
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the log.
 */
static void log_init(void)
{
        ret_code_t err_code = NRF_LOG_INIT(NULL);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**@brief Function for initializing the timer.
 */
static void timer_init(void)
{
        ret_code_t err_code = app_timer_init();
        APP_ERROR_CHECK(err_code);

        // Create timers.
        err_code = app_timer_create(&m_packet_error_rate_update_timer_id,
                                    APP_TIMER_MODE_REPEATED,
                                    polling_packet_error_timer_handler);
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the Power manager. */
static void power_management_init(void)
{
        ret_code_t err_code;
        err_code = nrf_pwr_mgmt_init();
        APP_ERROR_CHECK(err_code);
}

static void polling_packet_error_timer_handler(void *p_context)
{
        UNUSED_PARAMETER(p_context);
        ret_code_t ret_val;
        // Update the packet error rate per
        uint32_t per_value = packet_error_rate_timeout_handler();

        if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
        {
                static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];

                // Sending the PER rate to peripheral side
                data_array[0] = get_packet_success_rate();
                NRF_LOG_DEBUG("Get_packet_success_rate %03d %%", get_packet_success_rate());

                //ret_code_t ret_val = ble_nus_c_string_send(&m_ble_nus_c, data_array, strlen(data_array));
                ret_val = ble_nus_c_string_send(&m_ble_nus_c, data_array, 1);
                if ((ret_val != NRF_ERROR_INVALID_STATE) && (ret_val != NRF_ERROR_RESOURCES))
                {
                        APP_ERROR_CHECK(ret_val);
                }
        }

        NRF_LOG_DEBUG("Received data = %06d", (receive_byte - previous_receive_byte) * 8);

        if (receive_byte > TEST_FIRMWARE_SIZE)
        {
                get_accumlated_packet_success_rate(&m_packet_error_result);
                //NRF_LOG_HEXDUMP_INFO(m_packet_error_result, sizeof(m_packet_error_result));
                NRF_LOG_INFO("Done.");
                NRF_LOG_INFO("=============================");
                NRF_LOG_INFO("Accumlate Packet Sent %08d", m_packet_error_result.radio_packet_ready);
                NRF_LOG_INFO("Accumlate Packet Receive CRCOK %08d", m_packet_error_result.radio_packet_crcok);

