jimmywong2003/nrf5-packet-error-rate-measurement-on-ble-connection/ble_app_image_transfer_c/main.c
                NRF_LOG_INFO("Send %d KB data with Packet Success Rate = %d", TEST_FIRMWARE_SIZE / 1024, m_packet_error_result.radio_packet_success_rate);
                NRF_LOG_INFO("=============================");
                if (m_packet_error_rate_timer_is_running)
                {
                        ret_val = app_timer_stop(m_packet_error_rate_update_timer_id);
                        APP_ERROR_CHECK(ret_val);
                        m_packet_error_rate_timer_is_running = false;
                }
        }
        previous_receive_byte = receive_byte;
}

static void scan_init(void)
{
        ret_code_t err_code;
        nrf_ble_scan_init_t init_scan;

        memset(&init_scan, 0, sizeof(init_scan));

        init_scan.connect_if_match = true;
        init_scan.conn_cfg_tag = APP_BLE_CONN_CFG_TAG;

        err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
        APP_ERROR_CHECK(err_code);

        // Setting filters for scanning.
        err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_NAME_FILTER, false);
        APP_ERROR_CHECK(err_code);

        err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_NAME_FILTER, m_target_periph_name);
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling events from the GATT library. */
void gatt_evt_handler(nrf_ble_gatt_t *p_gatt, nrf_ble_gatt_evt_t const *p_evt)
{
        if (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED)
        {
                NRF_LOG_INFO("ATT MTU exchange completed.");

                m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
                NRF_LOG_INFO("Ble NUS max data length set to 0x%X(%d)", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
        }
        else if (p_evt->evt_id == NRF_BLE_GATT_EVT_DATA_LENGTH_UPDATED)
        {
                NRF_LOG_INFO("Data length updated to %u bytes.", p_evt->params.data_length);
        }
}

/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
        ret_code_t err_code;

        err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
        APP_ERROR_CHECK(err_code);

        err_code = nrf_ble_gatt_att_mtu_central_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
        APP_ERROR_CHECK(err_code);

        err_code = nrf_ble_gatt_data_length_set(&m_gatt, BLE_CONN_HANDLE_INVALID, NRF_SDH_BLE_GAP_DATA_LENGTH);
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details Handle any pending log operation(s), then sleep until the next event occurs.
 */
static void idle_state_handle(void)
{
        app_sched_execute();
        if (NRF_LOG_PROCESS() == false)
        {
                nrf_pwr_mgmt_run();
        }
}

/**@brief Function for the Event Scheduler initialization.
 */
static void scheduler_init(void)
{
        APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

int main(void)
{

        ret_code_t err_code;
        // Initialize.
        log_init();
        uart_init();
        timer_init();
        leds_init();
        buttons_init();
        power_management_init();
        ble_stack_init();
        scheduler_init();
        scan_init();
        gatt_init();
        db_discovery_init();
        lbs_c_init();
        nus_c_init();
        its_c_init();

        // Start execution.
        NRF_LOG_INFO("Central : Check Packet Error Rate");
        scan_start();

        err_code = app_button_enable();
        APP_ERROR_CHECK(err_code);

        // Start application timers. == false
        if (m_packet_error_rate_timer_is_running == false)
        {
                err_code = app_timer_start(m_packet_error_rate_update_timer_id, PACKET_ERROR_UPDATE_TIMER_INTERVAL, NULL);
                APP_ERROR_CHECK(err_code);
                m_packet_error_rate_timer_is_running = true;
        }

        // Enter main loop.
        for (;;)
        {
                idle_state_handle();
        }
}
